In [1]:
# Pandas is most commonly used for data wrangling and data manipulation purposes
# NumPy is a fundamental library for numerical computing in Python.Mathematical Operations, Arrays,Linear Algebra etc
#Removing Duplicates
#Fixing NULL values(Age, Department)
#Standardization of each value(Gender)
#Concatenate First Name and Last Name
#Add a new column(YearsAtCompany)
#STrength by Maritial Status

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [122]:
pd.reset_option('display.max_rows',None)
df = pd.read_csv("Sample_HR.csv")

# df = df.shape
# print(f"No of rows {df}")

# df = df[df.duplicated()].shape[0]

df = df.drop_duplicates()

df.shape

# df =  df[df["Age"].isnull()]
avg_age =  int(df["Age"].mean())

df["Age"] = df["Age"].fillna(avg_age)
df["Department"] = df["Department"].fillna("Data Engineering")


df['Gender'] = df["Gender"].replace({"M":"Male","F":"Female"})


df["Name"] = df["First Name"] + ' ' + df["Last Name"]

,Employee_ID,First Name,Last Name,Gender,MaritalStatus,Department,Grade,Employee_Count,Job_Satisfaction,MonthlyIncome,...,Age,Job Type,Job Experience,Hire_Date,Company_Environment,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,Country,Name
0,1,Shelia,Mahoney,Male,Single,Sales,2,1,4,5993,...,41.0,Permannent,16,1/1/2010,5,0,1,6,United Kingdom,Shelia Mahoney
1,2,Jo,Rivers,Female,Married,TECH,2,1,2,5130,...,49.0,Contractual,14,2/1/2012,3,3,3,10,United States,Jo Rivers
2,3,Sheryl,Lowery,Female,Single,TECH,1,1,3,2090,...,37.0,Contractual,14,2/2/2012,4,3,3,0,Australia,Sheryl Lowery
3,4,Whitney,Hooper,Male,Married,TECH,1,1,3,2909,...,33.0,Contractual,14,2/3/2012,4,3,3,8,Australia,Whitney Hooper
4,5,Lindsey,Rice,Female,Married,Manfacturing,1,1,2,3468,...,27.0,Contractual,14,2/4/2012,1,3,3,2,Australia,Lindsey Rice
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1497,1466,Shelley,Benjamin,Male,Married,Data Engineering,2,1,4,2571,...,36.0,Contractual,8,2/1/2019,3,3,3,5,France,Shelley Benjamin
1498,1467,Isaiah,Jarvis,Male,Married,Data Engineering,3,1,5,9991,...,39.0,Contractual,8,2/2/2019,5,5,3,7,France,Isaiah Jarvis
1499,1468,Nathan,Sutton,Female,Married,Data Engineering,2,1,2,6142,...,27.0,Contractual,8,2/3/2019,2,0,3,6,France,Nathan Sutton
1500,1469,Earl,Mccullough,Female,Married,Sales,2,1,2,5390,...,49.0,Contractual,8,2/4/2019,4,3,2,9,France,Earl Mccullough
1501,1470,Alan,Mcdaniel,Female,Married,Data Engineering,2,1,5,4404,...,34.0,Contractual,8,2/5/2019,5,3,4,4,France,Alan Mcdaniel

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1470 entries, 0 to 1501
Data columns (total 20 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Employee_ID            1470 non-null   int64
 1   First Name             1470 non-null   object
 2   Last Name              1470 non-null   object
 3   Gender                 1470 non-null   object
 4   MaritalStatus          1470 non-null   object
 5   Department             1470 non-null   object
 6   Grade                  1470 non-null   int64
 7   Employee_Count         1470 non-null   int64
 8   Job_Satisfaction       1470 non-null   int64
 9   MonthlyIncome          1470 non-null   int64
 10  MonthlyRate            1470 non-null   int64
 11  Age                    1470 non-null   float64
 12  Job Type               1470 non-null   object
 13  Job Experience         1470 non-null   int64
 14  Hire_Date              1470 non-null   object
 15  Company_Environment    1470 non-null   int64
 16  TrainingTimesLastYear  1470 non-null   int64
 17  WorkLifeBalance        1470 non-null   int64
 18  YearsAtCompany         1470 non-null   int64
 19  Country                1470 non-null   object
dtypes: float64(1), int64(11), object(8)
memory usage: 241.2+ KB